Pizza_resepi = ("Тобі знадобиться:\nТепле молоко чи вода — 200 мл;\nСіль — 1 ч. л.;\nЦукор — 2 ч. л.;\nЖиві дріжджі — 25 г;\nБорошно — 330 г;\nОлія — 3 ст. л. \nСпосіб приготування:\nУ глибоку миску всипати сіль, цукор, додати тепле молоко (або воду), покришені дріжджі і добре вимішати віночком до розчинення інгредієнтів.\n\
У тісто додати половину просіяного борошна і знову розмішати віночком до однорідності. Потім всипати другу половину борошна та замішати тісто руками. Воно вийде досить тугим, так має бути. Коли тісто вбере майже все борошно, додати половину олії й вимішати, поки тісто не вбере її. Потім влити олію, що залишилася, і знову добре вимісити.\n\
Коли тісто вбере всю олію, сформувати з нього кулю, накрити рушником і залишити в теплому місці на одну годину. Це може бути попередньо розігріта на мінімумі та вимкнена духовка. За цей час тісто збільшиться втричі.\n\
Готове тісто можна розділити на дві частини і приготувати дві круглі піци діаметром 36 см. Можна зробити одну велику піцу на деко. Тісто злегка розкотити качалкою (борошном не підсипати ні тісто, ні поверхню). Деко злегка змастити олією, перекласти злегка розкачене тісто у форму і, розтягуючи руками, розподілити його по всій формі. Зробити невеликі бортики.\n\
Змастити основу кількома ложками кетчупу, а потім викласти начинку на свій смак. Випікати піцу потрібно в попередньо розігрітій до 250 градусів духовці 10-15 хв")
Potatoe_resepi = ("Тобі знадобиться:\n1 кілограм крохмалистої картоплі\nПівсклянки гарячого молока жирністю 3,2%\n1–2 чайних ложки солі/nВершкове масло — за смаком\nСпосіб приготування:\nКартоплю добре промийте, зніміть шкірку, наріжте невеликими шматками. Складіть картоплю в каструлю, залийте холодною водою, накрийте кришкою та поставте на вогонь. Коли вода закипить, посоліть та варіть картоплю 15–20 хвилин. Коли картопля буде готова, злийте воду, додайте в каструлю молоко та вершкове масло. Ретельно розімніть картоплю картоплем'ялкою — щоб не було грудочок. Картопляне пюре готове!\n\
Пам'ятайте, що картопляне пюре найкраще подавати на стіл гарячим — отже, готувати його потрібно безпосередньо перед застіллям.")
Bilyash_resepi = ("Тобі знадобиться:\nСоняшникова олія - 3 ст. л.\nСіль - 1 ч. л.\nЦукор - 1 ст. л.\nДріжджі мокрі - 40 г./nБорошно - 700 г.\nВода - 400 г.\nМ'ясний фарш - 400 г.\nЦибуля - 1 шт.\nСіль і спеції за смаком.\nСпосіб приготування:\nПідігрійте воду і покришіть в неї дріжджі руками. Всипте цукор і перемішайте. Додайте половину борошна, масло і сіль, знову перемішайте. Вмішайте решту борошна і замісіть тісто руками. Залиште в теплому місці на півгодини, щоб тісто піднялося.\n\
Цибулю потріть на дрібній тертці і додайте в фарш. Посоліть і приправте фарш за смаком, ретельно перемішайте. Тісто розділіть на однакові частини і розкачайте в тонкий пласт. За допомогою склянки виріжте однакові кружечки.\n\
У центр кожного кружечка викладіть по дві ложки начинки і защипніть пиріжки. Потім пріплюсніть пиріжки руками, щоб вони були плоскими і круглими. Біляші бажано робити тонкими, щоб вся начинка присмажилась.\n\
Налийте частину олії в сковороду з високими бортами і розігрійте. У гарячу олію викладіть біляші і смажте з кожного боку по 10 хвилин. Викласти готові біляші в каструлю з папером або газетами, щоб вбралося зайву олію.\n")
Bread_resepi = ("Тобі знадобиться:\n450 г пшеничного борошна;\n350 мл води;\nпо півтори чайних ложки цукру і сухих дріжджів;\n3 ст. л. рослинної олії;\nчайна ложка солі.\nСпосіб приготування:\nВоду закип'ятити і охолодити до 40 градусів. У ємність просіяти борошно, висипати в неї дріжджі, цукор і сіль, влити воду і олію. Спочатку перемішати масу ложкою, а потім вимісити вручну і скачати з тіста м'ячик.\n\
Чашу мультиварки змастити олією, посипати борошном і покласти туди тісто на 1 годину і 30 хвилин підходити, накривши рушником. Переставити чашу в мультиварку і закрити. На мультиварці взяти програму для випічки і час 65 хв./1 год.; температура 160°С. Після закінчення дістати хліб, перевернути іншою стороною, закрити кришку і попекти хліб ще хвилин 20\n")

print(input("Привіт! Я - перша програма Роми, яка хоче тобі допомогти з рецептами.\nЗараз я напішу тобі список рецептів, а ти точно, з великої літери напишеш що хочеш приготувати.\nНатисни Ентер, якщо зрозумів правила:)"))

  
strava = (input("Біляші\nПіца\nПюре\nХліб\n"))
strava = strava.strip()

match strava:
    case "Біляші": 
        print(Bilyash_resepi)
    case "Піца":
        print(Pizza_resepi)
    case "Пюре": 
        print(Potatoe_resepi)
    case "Хліб": 
        print(Bread_resepi)

#пофіксити циври в кондішинал, пофіксити неіснуючі страви, перенести рецепти у файли. Структури даних дікшеонарі.
x = int(input("Приготуємо щось ще?\nТак - 1\nНі - 2 "))

if x < int(2):
    strava = (input("Біляші\nПіца\nПюре\nХліб\n"))
    strava = strava.strip()
    match strava:
        case "Біляші": 
            print(Bilyash_resepi)
        case "Піца":
            print(Pizza_resepi)
        case "Пюре": 
            print(Potatoe_resepi)
        case "Хліб": 
            print(Bread_resepi)
else:
    print("Ну бувай тоді)")
